{
  "class": "org.batfish.minesweeper.question.compareRoutePolicies.CompareRoutePoliciesQuestion",
  "differential": false,
  "policy": "${policy}",
  "proposedPolicy": "${proposedPolicy}",
  "nodes": "${nodes}",
  "instance": {
    "description": "Finds route announcements for which a route policy has a particular behavior.",
    "instanceName": "compareRoutePolicies",
    "longDescription": "This question finds route announcements for which a route policy has a particular behavior. The behaviors can be: that the policy permits the route (`permit`) or that it denies the route (`deny`). Constraints can be imposed on the input route announcements of interest and, in the case of a `permit` action, also on the output route announcements of interest. Route policies are selected using node and policy specifiers, which might match multiple policies. In this case, a (possibly different) answer will be found for each policy. _Note:_ This question currently does not support all of the route policy features that Batfish supports. The question only supports common forms of matching on prefixes, communities, and AS-paths, as well as common forms of setting communities, the local preference, and the metric. The question logs all unsupported features that it encounters as warnings. Due to unsupported features, it is possible for the question to return no answers even for route policies that can in fact exhibit the specified behavior.",
    "orderedVariableNames": [
      "policy",
      "proposedPolicy",
      "nodes"
    ],
    "tags": [
      "routing"
    ],
    "variables": {
      "policy": {
        "description": "Only consider policies that match this specifier",
        "type": "routingPolicySpec",
        "optional": false,
        "displayName": "Policy"
      },
      "proposedPolicy": {
        "description": "Only consider policies that match this specifier",
        "type": "routingPolicySpec",
        "optional": false,
        "displayName": "Proposed Policy"
      },
      "nodes": {
        "description": "Only examine policies on nodes matching this specifier",
        "type": "nodeSpec",
        "optional": true,
        "displayName": "Nodes"
      }
    }
  }
}
